<?php


use Illuminate\Database\Seeder;

class BlockTableSeeder extends Seeder
{
    public function run()
    {
        $blocks = [
            [
                'model_id' => 1,
                'type_id' => 1,
                'title' => '<span class="c_orange">Сочетая</span> самое лучшее',
                'text' => 'Компактный внешне и удивительно просторный внутри. Быстрый, но экономичный. Способный одинаково успешно ездить в любых погодных условиях и в городе, и на трассе, и по проселку. Красивый, комфортный, недорогой. Казалось бы, автомобиль не может сочетать в себе так много плюсов, но LADA Granta — это под силу.',
                'url' => '/build/images/photos/models/granta/blocks/block_01/mobile/block_01.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 1,
                'type_id' => 1,
                'title' => '<span class="c_orange">Новое</span> в знакомом',
                'text' => 'А ведь правда, мы становимся лучше, умнее, опытнее, сильнее. Мы радуемся, открывая что-то новое в себе и рядом с собой. Замечаем, когда меняется действительно что-то важное – стиль, комфорт, возможности любимого автомобиля.',
                'url' => '/build/images/photos/models/granta/blocks/block_02/mobile/block_02.jpg',
                'pointers' => 5,
                'pnum' => 1,
                'show' => false
            ],
            [
                'model_id' => 1,
                'type_id' => 1,
                'title' => '<span class="c_orange">Забота</span> о каждом',
                'text' => 'Что может сравниться с той радостью, когда дарят подарок, который ты давно хотел? Только радость человека, которому даришь то, о чем он давно мечтал. Но потребности даже близких людей иногда понять непросто. Хорошо, что есть машина, умеющая учитывать самые разные запросы.',
                'url' => '/build/images/photos/models/granta/blocks/block_03/mobile/block_03.jpg',
                'pointers' => 5,
                'pnum' => 2,
                'show' => false,
            ],
            [
                'model_id' => 1,
                'type_id' => 1,
                'title' => '<span class="c_orange">Ответственность</span> и безопасность',
                'text' => 'Мир скоростей требует повышенного внимания. И повышенной отдачи: я слежу не только за собой, но и помогаю близким. А технологии помогают мне – ощутимо и эффективно! Особенно когда это комплекс электронных помощников водителя.<br><br> Благодаря проработанной силовой структуре кузова и современным системам безопасности LADA Granta лифтбек выполняет российские и европейские требования по защите водителя, пассажиров и пешеходов.',
                'url' => '/build/images/photos/models/granta/blocks/block_04/mobile/block_04.jpg',
                'pointers' => 6,
                'pnum' => 3,
                'show' => false,
            ],
            [
                'model_id' => 2,
                'type_id' => 1,
                'title' => '<span class="c_orange">Обновлённая</span> LADA Vesta',
                'text' => 'Седан LADA Vesta вместителен и удобен, при этом особое внимание уделено акустическому комфорту. Конструкция шасси объединяет плавность хода, проходимость и азартную управляемость. LADA Vesta отлично приспособлена для сложных климатических и дорожных условий: внешние панели кузова оцинкованы, силовой агрегат прикрыт мощной защитой, а на порогах и днище нанесено прочное антигравийное покрытие.',
                'url' => '/build/images/photos/models/vesta/blocks/block_01/mobile/block_01.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 2,
                'type_id' => 1,
                'title' => '<span class="c_orange">Совершенство</span> в графике и характере',
                'text' => 'Стильная, стремительная, яркая, LADA Vesta задаёт современный стандарт дизайна LADA. Силуэт седана выдержан в единой «Икс»-концепции, он 100-процентно узнаваемый и гармоничный. Фирменный стиль обозначен в деталях: выделенной тёмным цветом облицовке радиатора, подштамповках по бокам, световозвращателях задних фонарей. За счет приподнятой подоконной линии, удлиненного капота и покатой крыши автомобиль смотрится динамично и атлетично.',
                'url' => '/build/images/photos/models/vesta/blocks/block_02/mobile/block_02.jpg',
                'pointers' => 2,
                'pnum' => 1,
                'show' => false
            ],
            [
                'model_id' => 2,
                'type_id' => 1,
                'title' => '<span class="c_orange">Самый просторный</span> в классе салон',
                'text' => 'Исключительно просторный салон позволяет разместиться с максимальным удобством на передних креслах и на заднем диване – этому способствует высокий уровень эргономики сидений, которые обладают выверенной формой и специально подобранным наполнителем. Водительское кресло оснащено регулировкой высоты и поясничной поддержки. В сочетании с регулировкой руля по высоте и вылету это помогает подобрать удобную посадку, исходя из индивидуальных потребностей.',
                'url' => '/build/images/photos/models/vesta/blocks/block_03/mobile/vesta_3.jpg',
                'pointers' => 4,
                'pnum' => 2,
                'show' => false
            ],
            [
                'model_id' => 2,
                'type_id' => 1,
                'title' => '<span class="c_orange">Высокий</span> уровень защиты',
                'text' => 'LADA Vesta – это высокий уровень защиты. Автомобиль обеспечивает отличную обзорность и уверенную проходимость, электроника постоянно мониторит дорожную ситуацию, кузов с применением сталей повышенной прочности надежно защищает водителя и пассажиров.',
                'url' => '/build/images/photos/models/vesta/blocks/block_04/mobile/vesta-04.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
        ];

        DB::table('blocks')->insert($blocks);
    }
}
