<?php


use Illuminate\Database\Seeder;

class BlockTableSeeder extends Seeder
{
    public function run()
    {
        $blocks = [
            // Granta
            // sedan
            [
                'model_id' => 1,
                'type_id' => 1,
                'title' => '<span class="c_orange">Сочетая</span> самое лучшее',
                'text' => 'Народный автомобиль стал ярче и привлекательнее: новая Granta получила черты современной ДНК стиля LADA. «Икс»-графика переднего бампера, выразительная светотехника, новый рельеф багажника и, конечно, множество практичных улучшений – это LADA Granta, обновленная и любимая. ',
                'url' => '/build/images/photos/models/granta/blocks/sedan/block_01/mobile/block_01.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 1,
                'type_id' => 1,
                'title' => '<span class="c_orange">Новое</span> в знакомом',
                'text' => 'А ведь правда, мы становимся лучше, умнее, опытнее, сильнее. Мы радуемся, открывая что-то новое в себе и рядом с собой. Замечаем, когда меняется действительно что-то важное – стиль, комфорт, возможности любимого автомобиля.',
                'url' => '/build/images/photos/models/granta/blocks/sedan/block_02/mobile/block_02.jpg',
                'pointers' => 5,
                'pnum' => 1,
                'show' => false
            ],
            [
                'model_id' => 1,
                'type_id' => 1,
                'title' => '<span class="c_orange">Забота</span> о каждом',
                'text' => 'Что может сравниться с той радостью, когда дарят подарок, который ты давно хотел? Только радость человека, которому даришь то, о чем он давно мечтал. Но потребности даже близких людей иногда понять непросто. Хорошо, что есть машина, умеющая учитывать самые разные запросы.',
                'url' => '/build/images/photos/models/granta/blocks/sedan/block_03/mobile/block_03.jpg',
                'pointers' => 5,
                'pnum' => 2,
                'show' => false,
            ],
            [
                'model_id' => 1,
                'type_id' => 1,
                'title' => '<span class="c_orange">Ответственность</span> и безопасность',
                'text' => 'Мир скоростей требует повышенного внимания. И повышенной отдачи: я слежу не только за собой, но и помогаю близким. А технологии помогают мне – ощутимо и эффективно! Особенно когда это комплекс электронных помощников водителя.<br><br> Благодаря проработанной силовой структуре кузова и современным системам безопасности LADA Granta лифтбек выполняет российские и европейские требования по защите водителя, пассажиров и пешеходов.',
                'url' => '/build/images/photos/models/granta/blocks/sedan/block_04/mobile/block_04.jpg',
                'pointers' => 6,
                'pnum' => 3,
                'show' => false,
            ],
            // liftback
            [
                'model_id' => 1,
                'type_id' => 2,
                'title' => '<span class="c_orange">Сочетая</span> самое лучшее',
                'text' => 'Компактный внешне и удивительно просторный внутри. Быстрый, но экономичный. Способный одинаково успешно ездить в любых погодных условиях и в городе, и на трассе, и по проселку. Красивый, комфортный, недорогой. Казалось бы, автомобиль не может сочетать в себе так много плюсов, но LADA Granta — это под силу.',
                'url' => '/build/images/photos/models/granta/blocks/liftback/block_01/mobile/block_01.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 1,
                'type_id' => 2,
                'title' => '<span class="c_orange">Новое</span> в знакомом',
                'text' => 'А ведь правда, мы становимся лучше, умнее, опытнее, сильнее. Мы радуемся, открывая что-то новое в себе и рядом с собой. Замечаем, когда меняется действительно что-то важное – стиль, комфорт, возможности любимого автомобиля.',
                'url' => '/build/images/photos/models/granta/blocks/liftback/block_02/mobile/block_02.jpg',
                'pointers' => 0,
                'pnum' => 1,
                'show' => false
            ],
            [
                'model_id' => 1,
                'type_id' => 2,
                'title' => '<span class="c_orange">Забота</span> о каждом',
                'text' => 'Что может сравниться с той радостью, когда дарят подарок, который ты давно хотел? Только радость человека, которому даришь то, о чем он давно мечтал. Но потребности даже близких людей иногда понять непросто. Хорошо, что есть машина, умеющая учитывать самые разные запросы.',
                'url' => '/build/images/photos/models/granta/blocks/liftback/block_03/mobile/block_03.jpg',
                'pointers' => 0,
                'pnum' => 2,
                'show' => false,
            ],
            [
                'model_id' => 1,
                'type_id' => 2,
                'title' => '<span class="c_orange">Ответственность</span> и безопасность',
                'text' => 'Мир скоростей требует повышенного внимания. И повышенной отдачи: я слежу не только за собой, но и помогаю близким. А технологии помогают мне – ощутимо и эффективно! Особенно когда это комплекс электронных помощников водителя.<br><br> Благодаря проработанной силовой структуре кузова и современным системам безопасности LADA Granta лифтбек выполняет российские и европейские требования по защите водителя, пассажиров и пешеходов.',
                'url' => '/build/images/photos/models/granta/blocks/liftback/block_04/mobile/block_04.jpg',
                'pointers' => 0,
                'pnum' => 3,
                'show' => false,
            ],
            // universal
            [
                'model_id' => 1,
                'type_id' => 3,
                'title' => '<span class="c_orange">Сочетая</span> самое лучшее',
                'text' => 'Компактный внешне и удивительно просторный внутри. Быстрый, но экономичный. Способный одинаково успешно ездить в любых погодных условиях и в городе, и на трассе, и по проселку. Красивый, комфортный, недорогой. Казалось бы, автомобиль не может сочетать в себе так много плюсов, но LADA Granta — это под силу.',
                'url' => '/build/images/photos/models/granta/blocks/block_01/mobile/block_01.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 1,
                'type_id' => 3,
                'title' => '<span class="c_orange">Новое</span> в знакомом',
                'text' => 'А ведь правда, мы становимся лучше, умнее, опытнее, сильнее. Мы радуемся, открывая что-то новое в себе и рядом с собой. Замечаем, когда меняется действительно что-то важное – стиль, комфорт, возможности любимого автомобиля.',
                'url' => '/build/images/photos/models/granta/blocks/block_02/mobile/block_02.jpg',
                'pointers' => 0,
                'pnum' => 1,
                'show' => false
            ],
            [
                'model_id' => 1,
                'type_id' => 3,
                'title' => '<span class="c_orange">Забота</span> о каждом',
                'text' => 'Что может сравниться с той радостью, когда дарят подарок, который ты давно хотел? Только радость человека, которому даришь то, о чем он давно мечтал. Но потребности даже близких людей иногда понять непросто. Хорошо, что есть машина, умеющая учитывать самые разные запросы.',
                'url' => '/build/images/photos/models/granta/blocks/block_03/mobile/block_03.jpg',
                'pointers' => 0,
                'pnum' => 2,
                'show' => false,
            ],
            [
                'model_id' => 1,
                'type_id' => 3,
                'title' => '<span class="c_orange">Ответственность</span> и безопасность',
                'text' => 'Мир скоростей требует повышенного внимания. И повышенной отдачи: я слежу не только за собой, но и помогаю близким. А технологии помогают мне – ощутимо и эффективно! Особенно когда это комплекс электронных помощников водителя.<br><br> Благодаря проработанной силовой структуре кузова и современным системам безопасности LADA Granta лифтбек выполняет российские и европейские требования по защите водителя, пассажиров и пешеходов.',
                'url' => '/build/images/photos/models/granta/blocks/block_04/mobile/block_04.jpg',
                'pointers' => 0,
                'pnum' => 3,
                'show' => false,
            ],
            // cross
            [
                'model_id' => 1,
                'type_id' => 4,
                'title' => '<span class="c_orange">Кроссовер</span> универсал',
                'text' => '… или универсальный кроссовер? Все зависит от того, куда мы сегодня поедем. Дорога до пляжа – это место, где свою роль сыграет самый большой в семействе LADA Granta дорожный просвет – 198 мм. Встреча с друзьями – это повод, чтобы почувствовать взгляд, задержавшийся на стильном автомобиле. Гипермаркет – это место, где пригодится практичный багажник, и заднее сиденье, которое можно сложить полностью или по частям. Город, шоссе и вообще любая дорога – это среда обитания LADA Granta Cross, где автомобиль показывает свои лучшие качества.',
                'url' => '/build/images/photos/models/granta/blocks/cross/block_01/mobile/block_01.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 1,
                'type_id' => 4,
                'title' => '<span class="c_orange">Новое</span> в знакомом',
                'text' => 'А ведь правда, мы становимся лучше, умнее, опытнее, сильнее. Мы радуемся, открывая что-то новое в себе и рядом с собой. Замечаем, когда меняется действительно что-то важное – стиль, комфорт, возможности любимого автомобиля.',
                'url' => '/build/images/photos/models/granta/blocks/cross/block_02/mobile/block_02.jpg',
                'pointers' => 0,
                'pnum' => 1,
                'show' => false
            ],
            [
                'model_id' => 1,
                'type_id' => 4,
                'title' => '<span class="c_orange">Внимание</span>к деталям',
                'text' => 'Семейному многозадачному автомобилю необходим просторный салон. Нужно ощущение воздуха. Чтобы был запас пространства по ширине, по высоте. Ведь мы ездим круглый год, перевозим множество вещей, а главное – пассажиров, у каждого из которых есть свой набор, который он берет в поездку. Именно по таким принципам построен интерьер компактного, но вместительного универсала LADA Granta Cross.',
                'url' => '/build/images/photos/models/granta/blocks/cross/block_03/mobile/block_03.jpg',
                'pointers' => 0,
                'pnum' => 2,
                'show' => false,
            ],
            [
                'model_id' => 1,
                'type_id' => 4,
                'title' => '<span class="c_orange">Ответственность</span> и безопасность',
                'text' => 'Мир скоростей требует повышенного внимания. И повышенной отдачи: я слежу не только за собой, но и помогаю близким. А технологии помогают мне – ощутимо и эффективно! Особенно когда это комплекс электронных помощников водителя.<br><br> Благодаря проработанной силовой структуре кузова и современным системам безопасности LADA Granta Cross выполняет российские и европейские требования по защите водителя, пассажиров и пешеходов.',
                'url' => '/build/images/photos/models/granta/blocks/cross/block_04/mobile/block_04.jpg',
                'pointers' => 0,
                'pnum' => 3,
                'show' => false,
            ],
            // drive active
            [
                'model_id' => 1,
                'type_id' => 5,
                'title' => '<span class="c_orange">Сочетая</span> самое лучшее',
                'text' => 'Компактный внешне и удивительно просторный внутри. Быстрый, но экономичный. Способный одинаково успешно ездить в любых погодных условиях и в городе, и на трассе, и по проселку. Красивый, комфортный, недорогой. Казалось бы, автомобиль не может сочетать в себе так много плюсов, но LADA Granta — это под силу.',
                'url' => '/build/images/photos/models/granta/blocks/block_01/mobile/block_01.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 1,
                'type_id' => 5,
                'title' => '<span class="c_orange">Новое</span> в знакомом',
                'text' => 'А ведь правда, мы становимся лучше, умнее, опытнее, сильнее. Мы радуемся, открывая что-то новое в себе и рядом с собой. Замечаем, когда меняется действительно что-то важное – стиль, комфорт, возможности любимого автомобиля.',
                'url' => '/build/images/photos/models/granta/blocks/block_02/mobile/block_02.jpg',
                'pointers' => 0,
                'pnum' => 1,
                'show' => false
            ],
            [
                'model_id' => 1,
                'type_id' => 5,
                'title' => '<span class="c_orange">Забота</span> о каждом',
                'text' => 'Что может сравниться с той радостью, когда дарят подарок, который ты давно хотел? Только радость человека, которому даришь то, о чем он давно мечтал. Но потребности даже близких людей иногда понять непросто. Хорошо, что есть машина, умеющая учитывать самые разные запросы.',
                'url' => '/build/images/photos/models/granta/blocks/block_03/mobile/block_03.jpg',
                'pointers' => 0,
                'pnum' => 2,
                'show' => false,
            ],
            [
                'model_id' => 1,
                'type_id' => 5,
                'title' => '<span class="c_orange">Ответственность</span> и безопасность',
                'text' => 'Мир скоростей требует повышенного внимания. И повышенной отдачи: я слежу не только за собой, но и помогаю близким. А технологии помогают мне – ощутимо и эффективно! Особенно когда это комплекс электронных помощников водителя.<br><br> Благодаря проработанной силовой структуре кузова и современным системам безопасности LADA Granta лифтбек выполняет российские и европейские требования по защите водителя, пассажиров и пешеходов.',
                'url' => '/build/images/photos/models/granta/blocks/block_04/mobile/block_04.jpg',
                'pointers' => 6,
                'pnum' => 3,
                'show' => false,
            ],
            // hatchback
            [
                'model_id' => 1,
                'type_id' => 6,
                'title' => '<span class="c_orange">Сочетая</span> самое лучшее',
                'text' => 'Компактный внешне и удивительно просторный внутри. Быстрый, но экономичный. Способный одинаково успешно ездить в любых погодных условиях и в городе, и на трассе, и по проселку. Красивый, комфортный, недорогой. Казалось бы, автомобиль не может сочетать в себе так много плюсов, но LADA Granta — это под силу.',
                'url' => '/build/images/photos/models/granta/blocks/block_01/mobile/block_01.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 1,
                'type_id' => 6,
                'title' => '<span class="c_orange">Новое</span> в знакомом',
                'text' => 'А ведь правда, мы становимся лучше, умнее, опытнее, сильнее. Мы радуемся, открывая что-то новое в себе и рядом с собой. Замечаем, когда меняется действительно что-то важное – стиль, комфорт, возможности любимого автомобиля.',
                'url' => '/build/images/photos/models/granta/blocks/block_02/mobile/block_02.jpg',
                'pointers' => 0,
                'pnum' => 1,
                'show' => false
            ],
            [
                'model_id' => 1,
                'type_id' => 6,
                'title' => '<span class="c_orange">Забота</span> о каждом',
                'text' => 'Что может сравниться с той радостью, когда дарят подарок, который ты давно хотел? Только радость человека, которому даришь то, о чем он давно мечтал. Но потребности даже близких людей иногда понять непросто. Хорошо, что есть машина, умеющая учитывать самые разные запросы.',
                'url' => '/build/images/photos/models/granta/blocks/block_03/mobile/block_03.jpg',
                'pointers' => 0,
                'pnum' => 2,
                'show' => false,
            ],
            [
                'model_id' => 1,
                'type_id' => 6,
                'title' => '<span class="c_orange">Ответственность</span> и безопасность',
                'text' => 'Мир скоростей требует повышенного внимания. И повышенной отдачи: я слежу не только за собой, но и помогаю близким. А технологии помогают мне – ощутимо и эффективно! Особенно когда это комплекс электронных помощников водителя.<br><br> Благодаря проработанной силовой структуре кузова и современным системам безопасности LADA Granta лифтбек выполняет российские и европейские требования по защите водителя, пассажиров и пешеходов.',
                'url' => '/build/images/photos/models/granta/blocks/block_04/mobile/block_04.jpg',
                'pointers' => 0,
                'pnum' => 3,
                'show' => false,
            ],
            // Vesta
            [
                'model_id' => 2,
                'type_id' => 1,
                'title' => '<span class="c_orange">Обновлённая</span> LADA Vesta',
                'text' => 'Седан LADA Vesta вместителен и удобен, при этом особое внимание уделено акустическому комфорту. Конструкция шасси объединяет плавность хода, проходимость и азартную управляемость. LADA Vesta отлично приспособлена для сложных климатических и дорожных условий: внешние панели кузова оцинкованы, силовой агрегат прикрыт мощной защитой, а на порогах и днище нанесено прочное антигравийное покрытие.',
                'url' => '/build/images/photos/models/vesta/blocks/block_01/mobile/block_01.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 2,
                'type_id' => 1,
                'title' => '<span class="c_orange">Совершенство</span> в графике и характере',
                'text' => 'Стильная, стремительная, яркая, LADA Vesta задаёт современный стандарт дизайна LADA. Силуэт седана выдержан в единой «Икс»-концепции, он 100-процентно узнаваемый и гармоничный. Фирменный стиль обозначен в деталях: выделенной тёмным цветом облицовке радиатора, подштамповках по бокам, световозвращателях задних фонарей. За счет приподнятой подоконной линии, удлиненного капота и покатой крыши автомобиль смотрится динамично и атлетично.',
                'url' => '/build/images/photos/models/vesta/blocks/block_02/mobile/block_02.jpg',
                'pointers' => 2,
                'pnum' => 1,
                'show' => false
            ],
            [
                'model_id' => 2,
                'type_id' => 1,
                'title' => '<span class="c_orange">Самый просторный</span> в классе салон',
                'text' => 'Исключительно просторный салон позволяет разместиться с максимальным удобством на передних креслах и на заднем диване – этому способствует высокий уровень эргономики сидений, которые обладают выверенной формой и специально подобранным наполнителем. Водительское кресло оснащено регулировкой высоты и поясничной поддержки. В сочетании с регулировкой руля по высоте и вылету это помогает подобрать удобную посадку, исходя из индивидуальных потребностей.',
                'url' => '/build/images/photos/models/vesta/blocks/block_03/mobile/vesta_3.jpg',
                'pointers' => 4,
                'pnum' => 2,
                'show' => false
            ],
            [
                'model_id' => 2,
                'type_id' => 1,
                'title' => '<span class="c_orange">Высокий</span> уровень защиты',
                'text' => 'LADA Vesta – это высокий уровень защиты. Автомобиль обеспечивает отличную обзорность и уверенную проходимость, электроника постоянно мониторит дорожную ситуацию, кузов с применением сталей повышенной прочности надежно защищает водителя и пассажиров.',
                'url' => '/build/images/photos/models/vesta/blocks/block_04/mobile/vesta-04.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],

            //vesta SW
            [
                'model_id' => 2,
                'type_id' => 7,
                'title' => '<span class="c_orange">Обновлённая</span> LADA Vesta',
                'text' => 'Машины с кузовом типа «SW» ориентированы на активный отдых и длительные путешествия. Поэтому здесь увеличено пространство для пассажиров и предусмотрено много ниш для хранения. А еще этот автомобиль по-настоящему красив – ведь он должен нравиться всем членам своей семьи!',
                'url' => '/build/images/photos/models/vesta/blocks/sw/block_01/mobile/block_01.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 2,
                'type_id' => 7,
                'title' => '<span class="c_orange">Совершенство</span> в графике и характере',
                'text' => 'Рельефные боковины кузова, эффектная светотехника – это LADA Vesta SW, автомобиль, в котором элегантный дизайн сочетается с просторным салоном и отличной управляемостью. Ниспадающая линия крыши формирует стремительный облик, который дополнен антенной типа «акулий плавник» и аналогичной треугольной формой задней стойки. ',
                'url' => '/build/images/photos/models/vesta/blocks/sw/block_02/mobile/block_02.jpg',
                'pointers' => 2,
                'pnum' => 1,
                'show' => false
            ],
            [
                'model_id' => 2,
                'type_id' => 7,
                'title' => '<span class="c_orange">Самый просторный</span> в классе салон',
                'text' => 'Просторный салон – то что надо для городских поездок и дальних путешествий! В интерьере продумана каждая деталь – от регулировок водительского кресла до новых, более удобных подстаканников, от охлаждаемого перчаточного ящика – до подогрева всех сидений. Высокий уровень эргономики достигается и выверенной формой кресел, специально подобранным наполнителем для подушки и спинки. ',
                'url' => '/build/images/photos/models/vesta/blocks/sw/block_03/mobile/vesta_3.jpg',
                'pointers' => 4,
                'pnum' => 2,
                'show' => false
            ],
            [
                'model_id' => 2,
                'type_id' => 7,
                'title' => '<span class="c_orange">Мультимедийная</span> система',
                'text' => 'Мультимедийная система с 7-дюймовым экраном – это любимая музыка, новости по радио, телефонная связь hands free. Отличный гаджет для того, чтобы послушать музыку, проложить путь в навигаторе - и в итоге сделать каждую поездку приятней.',
                'url' => '/build/images/photos/models/vesta/blocks/sw/block_04/mobile/block_04.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 2,
                'type_id' => 7,
                'title' => '<span class="c_orange">Трансформация</span> багажного отсека',
                'text' => 'Машины с кузовом типа «SW» ориентированы на активный отдых и длительные путешествия. Поэтому здесь увеличено пространство для пассажиров и предусмотрено много ниш для хранения.',
                'url' => '/build/images/photos/models/vesta/blocks/sw/block_05/mobile/block_05.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 2,
                'type_id' => 7,
                'title' => '<span class="c_orange">Высокий</span> уровень защиты',
                'text' => 'Высокий уровень безопасности, начиная с базовой комплектации – это часть философии LADA Vesta. Система контроля устойчивости ESC позволяет уверенно маневрировать на дорогах с любым покрытием. Система экстренного оповещения ЭРА-ГЛОНАСС, мощный каркас кузова с применением сталей повышенной прочности и фронтальные подушки безопасности – это надежная защита водителя пассажиров. ',
                'url' => '/build/images/photos/models/vesta/blocks/sw/block_06/mobile/block_06.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],

            //SW CROSS
            [
                'model_id' => 2,
                'type_id' => 8,
                'title' => '<span class="c_orange">Обновлённая</span> LADA Vesta',
                'text' => 'Больше возможностей на дороге и вне ее пределов – вот философия LADA Vesta SW Cross! Контрастный спортивный стиль сочетается с комфортом и отличной проходимостью: у LADA Vesta SW Cross дорожный просвет, достойный кроссовера. 203 миллиметра клиренса позволяют не переживать о высоте бордюра, глубине снега или грунтовой колеи. ',
                'url' => '/build/images/photos/models/vesta/blocks/sw_cross/block_01/mobile/block_01.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 2,
                'type_id' => 8,
                'title' => '<span class="c_orange">Совершенство</span> в графике и характере',
                'text' => 'Стремительный автомобиль на мощных колесах. Высоко приподнятый кузов, окаймленный полосой защитного пластика. Пластиковый обвес порогов, арок колес и дверей защитит эмаль кузова при поездках по лёгкому бездорожью. А еще эти стильные элементы делают автомобиль зрительно крупнее! ',
                'url' => '/build/images/photos/models/vesta/blocks/sw_cross/block_02/mobile/block_02.jpg',
                'pointers' => 2,
                'pnum' => 1,
                'show' => false
            ],
            [
                'model_id' => 2,
                'type_id' => 8,
                'title' => '<span class="c_orange">Самый просторный</span> в классе салон',
                'text' => 'Самый просторный в классе салон – это возможность разместиться с максимальным удобством. А полный комплект опций для достижения наибольшего комфорта позволяет сконцентрироваться на главном — удовольствии от вождения. Особое внимание уделено пассажирам – для них предусмотрен обогрев заднего сиденья, отдельный плафон освещения и USB-гнездо для подзарядки гаджетов. ',
                'url' => '/build/images/photos/models/vesta/blocks/sw_cross/block_03/mobile/vesta_3.jpg',
                'pointers' => 4,
                'pnum' => 2,
                'show' => false
            ],
            [
                'model_id' => 2,
                'type_id' => 8,
                'title' => '<span class="c_orange">Мультимедийная</span> система',
                'text' => 'Мультимедийная система с 7-дюймовым экраном – это любимая музыка, новости по радио, телефонная связь hands free. Отличный гаджет для того, чтобы послушать музыку, проложить путь в навигаторе - и в итоге сделать каждую поездку приятней.',
                'url' => '/build/images/photos/models/vesta/blocks/sw_cross/block_04/mobile/block_04.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 2,
                'type_id' => 8,
                'title' => '<span class="c_orange">Трансформация</span> багажного отсека',
                'text' => '«Органайзер на колесах» - лучший комплимент для автомобиля такого класса. Двойной пол багажника, множество ниш и крепежа для самого разнообразного груза, раскладная спинка сиденья – каждая деталь LADA Vesta SW Cross говорит о практичности семейного автомобиля. Объем багажного отделения – 480 л (до полки-шторки), а при сложенных сиденьях второго ряда – 825 л (до подоконной линии). ',
                'url' => '/build/images/photos/models/vesta/blocks/sw_cross/block_05/mobile/block_05.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 2,
                'type_id' => 8,
                'title' => '<span class="c_orange">Высокий</span> уровень защиты',
                'text' => 'Высокий уровень безопасности, начиная с базовой комплектации – это часть философии LADA Vesta. Система контроля устойчивости ESC позволяет уверенно маневрировать на дорогах с любым покрытием. Система экстренного оповещения ЭРА-ГЛОНАСС, мощный каркас кузова с применением сталей повышенной прочности и фронтальные подушки безопасности – это надежная защита водителя пассажиров. ',
                'url' => '/build/images/photos/models/vesta/blocks/sw_cross/block_06/mobile/block_06.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],

            // XRay
            [
                'model_id' => 3,
                'type_id' => 20,
                'title' => '<span class="c_orange">Кроссовер LADA XRAY создан для тех, кто не привык теряться в толпе.</span>',
                'text' => 'Быть выше, быть ярче, быть заметней, быть свободным – это стиль тех, кто выбирает LADA XRAY. Максимум впечатлений уже ждёт Вас за рулём LADA XRAY!',
                'url' => '/build/images/photos/models/xray/blocks/block_01/mobile/block_01.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 3,
                'type_id' => 20,
                'title' => '<span class="c_orange">Компактный – но солидный, высокий – но динамичный Это LADA XRAY</span>',
                'text' => 'Рельефная поверхность крыльев и дверей подчеркивает динамичный стиль уверенного в себе кроссовера. Автомобиль с развитой «мускулатурой» преуспевает во всех дисциплинах: скоростная поездка по трассе, маневрирование в тесноте города, уверенное движение по грунту, снегу и неровностям урбанистического пейзажа.',
                'url' => '/build/images/photos/models/xray/blocks/block_02/mobile/block_02.jpg',
                'pointers' => 4,
                'pnum' => 1,
                'show' => false
            ],
            [
                'model_id' => 3,
                'type_id' => 20,
                'title' => '<span class="c_orange">LADA XRAY создан по принципу «Автомобиль – мой второй дом»: интерьер машины комфортен и рационален.</span>',
                'text' => 'В салоне - набор ниш и подстаканников, карманы в обивках дверей, охлаждаемый перчаточный ящик. В багажнике – крепления для сетки, пластиковые ниши за арками задних колес. Заднее сиденье складывается в пропорции 60/40, что позволяет при необходимости перевозить габаритный груз. Отделение под полом багажника для вещей, которые необходимо хранить не на виду. Обеспечена новая вместительность салона: увеличена длина салона, что улучшило комфорт для пассажиров заднего сиденья. Благодаря широкому заднему проему пятой двери просто и легко разместить багаж для всей семьи.',
                'url' => '/build/images/photos/models/xray/blocks/block_03/mobile/xray_03.jpg',
                'pointers' => 0,
                'pnum' => 2,
                'show' => false
            ],
            [
                'model_id' => 3,
                'type_id' => 20,
                'title' => '<span class="c_orange">Динамика и комфорт</span>',
                'text' => 'За активную безопасность автомобиля отвечает функция курсовой устойчивости ESC. Интеллектуальная система предотвращает занос автомобиля и включает ряд необходимых опций безопасности: антиблокировочная система тормозов (ABS): в случае экстренного торможения сохраняет управляемость автомобиля; усилитель экстренного торможения (BAS): при резком нажатии на педаль тормоза система автоматически повышает давление в тормозной магистрали, максимально эффективно замедляя автомобиль; противобуксовочная система (TCS): обеспечивает динамичный старт на скользком или неоднородном покрытии, а в случае пробуксовки одного из колес система выполняет функцию блокировки дифференциала; система распределения тормозных усилий (EBD): оптимально делит усилия между осями, предотвращая занос.',
                'url' => '/build/images/photos/models/xray/blocks/block_04/mobile/xray_04.jpg',
                'pointers' => 0,
                'pnum' => 3,
                'show' => false
            ],
            [
                'model_id' => 3,
                'type_id' => 20,
                'title' => '<span class="c_orange">Активная безопасность</span>',
                'text' => 'За активную безопасность автомобиля отвечает функция курсовой устойчивости ESC.

Интеллектуальная система предотвращает занос автомобиля и включает ряд необходимых опций безопасности:

антиблокировочная система тормозов (ABS): в случае экстренного торможения сохраняет управляемость автомобиля;

усилитель экстренного торможения (BAS): при резком нажатии на педаль тормоза система автоматически повышает давление в тормозной магистрали, максимально эффективно замедляя автомобиль;

противобуксовочная система (TCS): обеспечивает динамичный старт на скользком или неоднородном покрытии, а в случае пробуксовки одного из колес система выполняет функцию блокировки дифференциала;

система распределения тормозных усилий (EBD): оптимально делит усилия между осями, предотвращая занос.',
                'url' => '',
                'pointers' => 0,
                'pnum' => 4,
                'show' => false
            ],
            [
                'model_id' => 3,
                'type_id' => 20,
                'title' => '<span class="c_orange">Пассивная безопасность</span>',
                'text' => 'В каждом LADA XRAY – подушка безопасности водителя и пассажира, передние ремни безопасности с механизмом предварительного натяжения и ограничителем нагрузки.

Для комфортной и безопасной перевозки юных пассажиров LADA XRAY оснащен системой крепления детских кресел ISOFIX и блокировкой задних дверей.

Безопасный автомобиль – тот, который заметен на дороге. LADA XRAY никогда не потеряется в потоке, благодаря ярким светодиодным дневным ходовым огням. Светодиодная полоска выполняет и стилевую функцию, подсвечивая хромированный «Икс» передка.',
                'url' => '',
                'pointers' => 0,
                'pnum' => 5,
                'show' => false
            ],
            // 4x4
            [
                'model_id' => 4,
                'type_id' => 11,
                'title' => '<span class="c_orange">LADA 4x4</span>',
                'text' => 'Трудные дорожные условия. Теснота городских кварталов. Бескрайние поля и лесные тропинки... Это среда обитания LADA 4х4, она была, есть и будет. Именно поэтому LADA 4х4 входит в число самых легендарных автомобилей мира, вызывающих восхищение миллионов людей.

Отличное сочетание компактности, проходимости и комфортной цены – это делает LADA 4х4 необыкновенно популярной. Сохраняя выдающие внедорожные свойства и узнаваемый стиль, мы сделали автомобиль более комфортным, более функциональным и безопасным. ',
                'url' => '/build/images/photos/models/4x4/blocks/block_01/mobile/4x4_1.jpg',
                'pointers' => 3,
                'pnum' => 1,
                'show' => false
            ],
            [
                'model_id' => 4,
                'type_id' => 11,
                'title' => '<span class="c_orange">Улучшенная шумоизоляция</span>',
                'text' => 'Модернизированные опоры силового агрегата снизили уровень вибраций, а кроме того, на панели кузова и защиту моторного отсека наклеены дополнительные шумо-виброгасящие элементы.',
                'url' => '/build/images/photos/models/4x4/blocks/block_02/mobile/4x4_2.jpg',
                'pointers' => 0,
                'pnum' => 2,
                'show' => false
            ],
            // LARGUS Cross
            [
                'model_id' => 5,
                'type_id' => 4,
                'title' => '<span class="c_orange">Обзор</span> Largus Cross',
                'text' => 'LADA Largus Cross - ожидаемое развитие самого продаваемого на российском авторынке универсала LADA Largus. Вместительность (5-ти и 7-местное исполнение), надежная подвеска, тяговитый двигатель - все это при самой выгодной цене в своем классе обеспечило семейству популярность у покупателей. LADA Largus Cross добавляет к этим преимуществам неоспоримые для российских условий качества - увеличенный дорожный просвет и, как следствие, лучшую проходимость. 

LADA Largus Cross - незаменимый помощник для семей, предпочитающих отдых на природе и активно использующих для этих целей автомобиль. Комфорт и вместительность пассажирского универсала с повышенной проходимостью обеспечат его владельцам удобство и уверенность в поездках с семьей, компанией друзей на дачу или на пикник. 

LADA Largus Cross - топ-предложение в модельной линейке, он создан на базе наиболее оснащенной версии.',
                'url' => '/build/images/photos/models/largus/blocks/cross/block_01/mobile/block_01.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 5,
                'type_id' => 4,
                'title' => '<span class="c_orange">Экстерьер</span>',
                'text' => 'LADA Largus Cross отличается от уже известного универсала более агрессивным дизайном. Его особенности – увеличенный дорожный просвет, защитные пластиковые накладки на переднем и заднем бамперах, арках колес и порогах, бампера с тиснением без окраски, оклеенные пленкой рамки дверей, легкосплавные диски колёс диаметром 16 дюймов с шинами увеличенной размерности.',
                'url' => '/build/images/photos/models/largus/blocks/cross/block_02/mobile/block_02.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 5,
                'type_id' => 4,
                'title' => '<span class="c_orange">Интерьер</span>',
                'text' => 'При сохранении прежней функциональности салона пассажирского универсала интерьер LADA Largus Cross получил немало оригинальности за счет яркой расцветки. В спинках передних кресел применены оранжевые кожаные вставки в плечевой зоне. Такого же цвета клетка и декоративная отстрочка швов служат орнаментом для всех сидений. Оранжевые кожаные вставки использованы и в обивке дверей. Элементы того же цвета органично вписаны в накладку центральной консоли. Надпись «Largus Cross» в пластиковой вставке на пороге – фирменный штрих обновленного универсала. Также доступен LADA Largus Cross с интерьером в классической светло-серой гамме.',
                'url' => '/build/images/photos/models/largus/blocks/cross/block_03/mobile/block_03.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            // XRAY CROSS
            [
                'model_id' => 3,
                'type_id' => 4,
                'title' => '<span class="c_orange">ДОРОГ СТАНОВИТСЯ</span> БОЛЬШЕ',
                'text' => 'Быть выше, быть ярче, быть заметней, быть свободным – это стиль тех, кто выбирает LADA XRAY. Максимум впечатлений уже ждёт Вас за рулём LADA XRAY!',
                'url' => '/build/images/photos/models/xray/blocks/cross/block_01/mobile/block_01.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 3,
                'type_id' => 4,
                'title' => '<span class="c_orange">КРОССОВЕР, </span> ЗАБЫВШИЙ О ГОРОДЕ',
                'text' => 'Легкая грубоватость, тщательно продуманная небрежность и несколько контрастных деталей… Это не просто стиль. Это прямое отражение характера, функций и предназначения.',
                'url' => '/build/images/photos/models/xray/blocks/cross/block_02/mobile/block_02.jpg',
                'pointers' => 4,
                'pnum' => 1,
                'show' => false
            ],
            [
                'model_id' => 3,
                'type_id' => 4,
                'title' => '<span class="c_orange">УДОБСТВО</span> В ДЕТАЛЯХ',
                'text' => 'LADA XRAY Cross — это множество полезных систем, которые повышают качество жизни и каждый день помогают в решении самых разных задач.',
                'url' => '/build/images/photos/models/xray/blocks/cross/block_03/mobile/xray_03.jpg',
                'pointers' => 0,
                'pnum' => 2,
                'show' => false
            ],
            [
                'model_id' => 3,
                'type_id' => 4,
                'title' => '<span class="c_orange">ПОЛЕЗНЫЕ</span> ТРАНСФОРМАЦИИ',
                'text' => 'Салон LADA XRAY Cross — это рационально организованное пространство. Каждый элемент салона продуман для того, чтобы LADA XRAY Cross был удобен и в туристической поездке, и для покупки новой мебели.',
                'url' => '/build/images/photos/models/xray/blocks/cross/block_04/mobile/xray_04.jpg',
                'pointers' => 0,
                'pnum' => 3,
                'show' => false
            ],
            [
                'model_id' => 3,
                'type_id' => 4,
                'title' => '<span class="c_orange">СИЛА</span> И ГИБКОСТЬ',
                'text' => 'Проявить силу, где она необходима. А где нужно – быть гибким. Быть начеку каждую секунду и реагировать мгновенно.

Эти слова могли бы быть философией боевого искусства, но стали принципами конструирования автомобиля. Современного безопасного автомобиля.',
                'url' => '/build/images/photos/models/xray/blocks/cross/block_05/mobile/xray_05.jpg',
                'pointers' => 0,
                'pnum' => 4,
                'show' => false
            ],
            [
                'model_id' => 3,
                'type_id' => 4,
                'title' => '<span class="c_orange">LADA Ride Select: </span> 5 РЕЖИМОВ ДВИЖЕНИЯ',
                'text' => 'Сложная дорога требует особой концентрации и нередко—решительности. А на хорошем шоссе порой хочется дать волю темпераменту…

Новые настройки шасси LADA XRAY Cross—это и способ реализовать жажду драйва, и помощь в разных условиях движения.',
                'url' => '/build/images/photos/models/xray/blocks/cross/block_06/mobile/xray_06.jpg',
                'pointers' => 0,
                'pnum' => 5,
                'show' => false
            ],
            [
                'model_id' => 3,
                'type_id' => 4,
                'title' => '<span class="c_orange">Мультимедийная </span> система',
                'text' => 'Системы Apple CarPlay и Android Auto позволят управлять мобильными приложениями прямо на 7” сенсорном дисплее автомобиля не отвлекаясь от дороги.

Наслаждаться любимой музыкой или безграничной базой аудиокниг, общаться по телефону с друзьями или слушать записи любимых концертов, прокладывать маршруты в объезд пробок или искать нужную информацию в интернете – всё это можно делать при помощи экрана мультимедийной системы или простых голосовых команд. Кроме того, в мультимедиа доступна штатная навигация. Вы всегда найдете выход из любой дорожной ситуации! ',
                'url' => '/build/images/photos/models/xray/blocks/cross/block_07/mobile/xray_07.jpg',
                'pointers' => 0,
                'pnum' => 5,
                'show' => false
            ],
            [
                'model_id' => 3,
                'type_id' => 3,
                'title' => '<span class="c_orange">АВТОМАТИЧЕСКАЯ </span> ТРАНСМИССИЯ',
                'text' => 'Это комфортное и уверенное движение по всем типам дорог. 

У LADA XRAY Cross с новой коробкой передач две педали: газ и тормоз. Управление удобно и интуитивно - автомобиль ускоряется плавно, без малейших рывков, сохраняя при этом отличную топливную экономичность.',
                'url' => '/build/images/photos/models/xray/blocks/cross/block_08/mobile/xray_08.jpg',
                'pointers' => 0,
                'pnum' => 5,
                'show' => false
            ],
        ];

        DB::table('blocks')->insert($blocks);
    }
}
