<?php


use Illuminate\Database\Seeder;

class BlockTableSeeder extends Seeder
{
    public function run()
    {
        $blocks = [
            [
                'model_id' => 1,
                'type_id' => 1,
                'title' => '<span class="c_orange">Сочетая</span> самое лучшее',
                'text' => 'Компактный внешне и удивительно просторный внутри. Быстрый, но экономичный. Способный одинаково успешно ездить в любых погодных условиях и в городе, и на трассе, и по проселку. Красивый, комфортный, недорогой. Казалось бы, автомобиль не может сочетать в себе так много плюсов, но LADA Granta — это под силу.',
                'url' => '/build/images/photos/models/granta/blocks/block_01/mobile/block_01.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 1,
                'type_id' => 1,
                'title' => '<span class="c_orange">Новое</span> в знакомом',
                'text' => 'А ведь правда, мы становимся лучше, умнее, опытнее, сильнее. Мы радуемся, открывая что-то новое в себе и рядом с собой. Замечаем, когда меняется действительно что-то важное – стиль, комфорт, возможности любимого автомобиля.',
                'url' => '/build/images/photos/models/granta/blocks/block_02/mobile/block_02.jpg',
                'pointers' => 5,
                'pnum' => 1,
                'show' => false
            ],
            [
                'model_id' => 1,
                'type_id' => 1,
                'title' => '<span class="c_orange">Забота</span> о каждом',
                'text' => 'Что может сравниться с той радостью, когда дарят подарок, который ты давно хотел? Только радость человека, которому даришь то, о чем он давно мечтал. Но потребности даже близких людей иногда понять непросто. Хорошо, что есть машина, умеющая учитывать самые разные запросы.',
                'url' => '/build/images/photos/models/granta/blocks/block_03/mobile/block_03.jpg',
                'pointers' => 5,
                'pnum' => 2,
                'show' => false,
            ],
            [
                'model_id' => 1,
                'type_id' => 1,
                'title' => '<span class="c_orange">Ответственность</span> и безопасность',
                'text' => 'Мир скоростей требует повышенного внимания. И повышенной отдачи: я слежу не только за собой, но и помогаю близким. А технологии помогают мне – ощутимо и эффективно! Особенно когда это комплекс электронных помощников водителя.<br><br> Благодаря проработанной силовой структуре кузова и современным системам безопасности LADA Granta лифтбек выполняет российские и европейские требования по защите водителя, пассажиров и пешеходов.',
                'url' => '/build/images/photos/models/granta/blocks/block_04/mobile/block_04.jpg',
                'pointers' => 6,
                'pnum' => 3,
                'show' => false,
            ],
            [
                'model_id' => 2,
                'type_id' => 1,
                'title' => '<span class="c_orange">Обновлённая</span> LADA Vesta',
                'text' => 'Седан LADA Vesta вместителен и удобен, при этом особое внимание уделено акустическому комфорту. Конструкция шасси объединяет плавность хода, проходимость и азартную управляемость. LADA Vesta отлично приспособлена для сложных климатических и дорожных условий: внешние панели кузова оцинкованы, силовой агрегат прикрыт мощной защитой, а на порогах и днище нанесено прочное антигравийное покрытие.',
                'url' => '/build/images/photos/models/vesta/blocks/block_01/mobile/block_01.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 2,
                'type_id' => 1,
                'title' => '<span class="c_orange">Совершенство</span> в графике и характере',
                'text' => 'Стильная, стремительная, яркая, LADA Vesta задаёт современный стандарт дизайна LADA. Силуэт седана выдержан в единой «Икс»-концепции, он 100-процентно узнаваемый и гармоничный. Фирменный стиль обозначен в деталях: выделенной тёмным цветом облицовке радиатора, подштамповках по бокам, световозвращателях задних фонарей. За счет приподнятой подоконной линии, удлиненного капота и покатой крыши автомобиль смотрится динамично и атлетично.',
                'url' => '/build/images/photos/models/vesta/blocks/block_02/mobile/block_02.jpg',
                'pointers' => 2,
                'pnum' => 1,
                'show' => false
            ],
            [
                'model_id' => 2,
                'type_id' => 1,
                'title' => '<span class="c_orange">Самый просторный</span> в классе салон',
                'text' => 'Исключительно просторный салон позволяет разместиться с максимальным удобством на передних креслах и на заднем диване – этому способствует высокий уровень эргономики сидений, которые обладают выверенной формой и специально подобранным наполнителем. Водительское кресло оснащено регулировкой высоты и поясничной поддержки. В сочетании с регулировкой руля по высоте и вылету это помогает подобрать удобную посадку, исходя из индивидуальных потребностей.',
                'url' => '/build/images/photos/models/vesta/blocks/block_03/mobile/vesta_3.jpg',
                'pointers' => 4,
                'pnum' => 2,
                'show' => false
            ],
            [
                'model_id' => 2,
                'type_id' => 1,
                'title' => '<span class="c_orange">Высокий</span> уровень защиты',
                'text' => 'LADA Vesta – это высокий уровень защиты. Автомобиль обеспечивает отличную обзорность и уверенную проходимость, электроника постоянно мониторит дорожную ситуацию, кузов с применением сталей повышенной прочности надежно защищает водителя и пассажиров.',
                'url' => '/build/images/photos/models/vesta/blocks/block_04/mobile/vesta-04.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 3,
                'type_id' => 20,
                'title' => '<span class="c_orange">Кроссовер LADA XRAY создан для тех, кто не привык теряться в толпе.</span>',
                'text' => 'Быть выше, быть ярче, быть заметней, быть свободным – это стиль тех, кто выбирает LADA XRAY. Максимум впечатлений уже ждёт Вас за рулём LADA XRAY!',
                'url' => '/build/images/photos/models/xray/blocks/block_01/mobile/block_01.jpg',
                'pointers' => 0,
                'pnum' => 0,
                'show' => false
            ],
            [
                'model_id' => 3,
                'type_id' => 20,
                'title' => '<span class="c_orange">Компактный – но солидный, высокий – но динамичный Это LADA XRAY</span>',
                'text' => 'Рельефная поверхность крыльев и дверей подчеркивает динамичный стиль уверенного в себе кроссовера. Автомобиль с развитой «мускулатурой» преуспевает во всех дисциплинах: скоростная поездка по трассе, маневрирование в тесноте города, уверенное движение по грунту, снегу и неровностям урбанистического пейзажа.',
                'url' => '/build/images/photos/models/xray/blocks/block_02/mobile/block_02.jpg',
                'pointers' => 4,
                'pnum' => 1,
                'show' => false
            ],
            [
                'model_id' => 3,
                'type_id' => 20,
                'title' => '<span class="c_orange">LADA XRAY создан по принципу «Автомобиль – мой второй дом»: интерьер машины комфортен и рационален.</span>',
                'text' => 'В салоне - набор ниш и подстаканников, карманы в обивках дверей, охлаждаемый перчаточный ящик. В багажнике – крепления для сетки, пластиковые ниши за арками задних колес. Заднее сиденье складывается в пропорции 60/40, что позволяет при необходимости перевозить габаритный груз. Отделение под полом багажника для вещей, которые необходимо хранить не на виду. Обеспечена новая вместительность салона: увеличена длина салона, что улучшило комфорт для пассажиров заднего сиденья. Благодаря широкому заднему проему пятой двери просто и легко разместить багаж для всей семьи.',
                'url' => '/build/images/photos/models/xray/blocks/block_03/mobile/xray_03.jpg',
                'pointers' => 0,
                'pnum' => 2,
                'show' => false
            ],
            [
                'model_id' => 3,
                'type_id' => 20,
                'title' => '<span class="c_orange">Динамика и комфорт</span>',
                'text' => 'За активную безопасность автомобиля отвечает функция курсовой устойчивости ESC. Интеллектуальная система предотвращает занос автомобиля и включает ряд необходимых опций безопасности: антиблокировочная система тормозов (ABS): в случае экстренного торможения сохраняет управляемость автомобиля; усилитель экстренного торможения (BAS): при резком нажатии на педаль тормоза система автоматически повышает давление в тормозной магистрали, максимально эффективно замедляя автомобиль; противобуксовочная система (TCS): обеспечивает динамичный старт на скользком или неоднородном покрытии, а в случае пробуксовки одного из колес система выполняет функцию блокировки дифференциала; система распределения тормозных усилий (EBD): оптимально делит усилия между осями, предотвращая занос.',
                'url' => '/build/images/photos/models/xray/blocks/block_04/mobile/xray_04.jpg',
                'pointers' => 0,
                'pnum' => 3,
                'show' => false
            ],
            [
                'model_id' => 3,
                'type_id' => 20,
                'title' => '<span class="c_orange">Активная безопасность</span>',
                'text' => 'За активную безопасность автомобиля отвечает функция курсовой устойчивости ESC.

Интеллектуальная система предотвращает занос автомобиля и включает ряд необходимых опций безопасности:

антиблокировочная система тормозов (ABS): в случае экстренного торможения сохраняет управляемость автомобиля;

усилитель экстренного торможения (BAS): при резком нажатии на педаль тормоза система автоматически повышает давление в тормозной магистрали, максимально эффективно замедляя автомобиль;

противобуксовочная система (TCS): обеспечивает динамичный старт на скользком или неоднородном покрытии, а в случае пробуксовки одного из колес система выполняет функцию блокировки дифференциала;

система распределения тормозных усилий (EBD): оптимально делит усилия между осями, предотвращая занос.',
                'url' => '',
                'pointers' => 0,
                'pnum' => 4,
                'show' => false
            ],
            [
                'model_id' => 3,
                'type_id' => 20,
                'title' => '<span class="c_orange">Пассивная безопасность</span>',
                'text' => 'В каждом LADA XRAY – подушка безопасности водителя и пассажира, передние ремни безопасности с механизмом предварительного натяжения и ограничителем нагрузки.

Для комфортной и безопасной перевозки юных пассажиров LADA XRAY оснащен системой крепления детских кресел ISOFIX и блокировкой задних дверей.

Безопасный автомобиль – тот, который заметен на дороге. LADA XRAY никогда не потеряется в потоке, благодаря ярким светодиодным дневным ходовым огням. Светодиодная полоска выполняет и стилевую функцию, подсвечивая хромированный «Икс» передка.',
                'url' => '',
                'pointers' => 0,
                'pnum' => 5,
                'show' => false
            ],
        ];

        DB::table('blocks')->insert($blocks);
    }
}
