<?php

use Illuminate\Database\Seeder;

class NewsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $news = [
            [
                'title' => 'Новость на сайте Брайт Парк №1',
                'text' => '<h3>Самая популярная модель LADA</h3><p>Товарищи! консультация с широким активом представляет собой интересный эксперимент
                    проверки соответствующий условий активизации. Задача организации, в особенности же постоянный
                    количественный рост и сфера нашей активности требуют определения и уточнения системы обучения
                    кадров, соответствует насущным потребностям.</p>
                    <p>Повседневная практика показывает, что реализация намеченных плановых заданий позволяет оценить значение системы обучения кадров, соответствует насущным потребностям. Не следует, однако забывать, что новая модель организационной деятельности представляет собой интересный эксперимент проверки существенных финансовых и административных условий. Повседневная практика показывает, что рамки и место обучения кадров в значительной степени обуславливает создание систем массового участия. Товарищи! консультация с широким активом в значительной степени обуславливает создание соответствующий условий активизации.</p>
                    <p>Идейные соображения высшего порядка, а также рамки и место обучения кадров играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. Равным образом новая модель организационной деятельности позволяет оценить значение форм развития.</p>',
                'text_short' => 'Товарищи! консультация с широким активом представляет собой интересный эксперимент
                    проверки соответствующий условий активизации. Задача организации, в особенности же постоянный
                    количественный рост и сфера нашей активности требуют определения и уточнения системы обучения
                    кадров, соответствует насущным потребностям.',
                'preview' => '/build/images/news/new_01.jpg',
                'slug' => 'novost_na_sajte_brajt_park_1',
                'city_id' => 0,
            ],
            [
                'title' => 'Новость на сайте Брайт Парк №2',
                'text' => '<p>Равным образом новая модель организационной деятельности обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. Задача организации, в особенности же реализация намеченных плановых заданий требуют определения и уточнения модели развития. Разнообразный и богатый опыт рамки и место обучения кадров требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Не следует, однако забывать, что постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании соответствующий условий активизации. Товарищи! реализация намеченных плановых заданий играет важную роль в формировании системы обучения кадров, соответствует насущным потребностям.</p>
                    <p>С другой стороны консультация с широким активом позволяет выполнять важные задания по разработке направлений прогрессивного развития. Значимость этих проблем настолько очевидна, что укрепление и развитие структуры играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач.</p>',
                'text_short' => 'Равным образом новая модель организационной деятельности обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. Задача организации, в особенности же реализация намеченных плановых заданий требуют определения и уточнения модели развития. Разнообразный и богатый опыт рамки и место обучения кадров требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач.',
                'preview' => '/build/images/news/new_02.jpg',
                'slug' => 'novost_na_sajte_brajt_park_2',
                'city_id' => 0,
            ],
        ];
        DB::table('news')->insert($news);
    }
}
