<?php

use Illuminate\Database\Seeder;

class StocksTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $stocks = [
            [
                'title' => 'Доплата 40 000 рублей при обмене на LADA Granta',
                'text' => '<p>Идейные соображения высшего порядка, а также начало повседневной работы по формированию позиции влечет за собой процесс внедрения и модернизации модели развития. Повседневная практика показывает, что дальнейшее развитие различных форм деятельности требуют определения и уточнения модели развития.</p>
                    <p>Равным образом новая модель организационной деятельности позволяет оценить значение новых предложений. Таким образом укрепление и развитие структуры представляет собой интересный эксперимент проверки дальнейших направлений развития. Задача организации, в особенности же дальнейшее развитие различных форм деятельности позволяет оценить значение дальнейших направлений развития. Разнообразный и богатый опыт рамки и место обучения кадров в значительной степени обуславливает создание модели развития. Значимость этих проблем настолько очевидна, что сложившаяся структура организации требуют определения и уточнения направлений прогрессивного развития.</p>
                    ',
                'text_short' => 'Идейные соображения высшего порядка, а также начало повседневной работы по формированию позиции влечет за собой процесс внедрения и модернизации модели развития. Повседневная практика показывает, что дальнейшее развитие различных форм деятельности требуют определения и уточнения модели развития.',
                'preview' => '/build/images/stocks/stock_01.jpg',
                'slug' => 'doplata_40_000_rublej_pri_obmene_na_lada_granta',
                'city_id' => 0,
            ],
            [
                'title' => 'LADA Vesta выгода 10% по госпрограмме',
                'text' => '<p>Задача организации, в особенности же социально-экономическое развитие предопределяет высокую востребованность модели развития. Каждый из нас понимает очевидную вещь: выбранный нами инновационный путь играет важную роль в формировании форм воздействия.</p>
<p>Вот вам яркий пример современных тенденций - экономическая повестка сегодняшнего дня, в своём классическом представлении, допускает внедрение как самодостаточных, так и внешне зависимых концептуальных решений. В своём стремлении улучшить пользовательский опыт мы упускаем, что предприниматели в сети интернет являются только методом политического участия и превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Не следует, однако, забывать, что синтетическое тестирование обеспечивает широкому кругу (специалистов) участие в формировании системы обучения кадров, соответствующей насущным потребностям. Сложно сказать, почему элементы политического процесса лишь добавляют фракционных разногласий и объявлены нарушающими общечеловеческие нормы этики и морали.</p>',
                'text_short' => 'Задача организации, в особенности же социально-экономическое развитие предопределяет высокую востребованность модели развития. Каждый из нас понимает очевидную вещь: выбранный нами инновационный путь играет важную роль в формировании форм воздействия.',
                'preview' => '/build/images/stocks/stock_02.jpg',
                'slug' => 'lada_vesta_vygoda_10_po_gosprogramme',
                'city_id' => 0,
            ],
            [
                'title' => 'LADA Granta 0% первоначальный взнос',
                'text' => '<p>Следует отметить, что выбранный нами инновационный путь способствует подготовке и реализации распределения внутренних резервов и ресурсов. Социально-экономическое развитие однозначно фиксирует необходимость системы обучения кадров, соответствующей насущным потребностям. Следует отметить, что граница обучения кадров требует анализа стандартных подходов. Прежде всего, постоянный количественный рост и сфера нашей активности требует определения и уточнения благоприятных перспектив.</p>

<p>Но экономическая повестка сегодняшнего дня прекрасно подходит для реализации новых принципов формирования материально-технической и кадровой базы. Сложно сказать, почему представители современных социальных резервов преданы социально-демократической анафеме. Имеется спорная точка зрения, гласящая примерно следующее: реплицированные с зарубежных источников, современные исследования являются только методом политического участия и ассоциативно распределены по отраслям.</p>

<p>Безусловно, высокотехнологичная концепция общественного уклада является качественно новой ступенью системы обучения кадров, соответствующей насущным потребностям. И нет сомнений, что предприниматели в сети интернет представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть в равной степени предоставлены сами себе.</p>',
                'text_short' => 'Следует отметить, что выбранный нами инновационный путь способствует подготовке и реализации распределения внутренних резервов и ресурсов. Социально-экономическое развитие однозначно фиксирует необходимость системы обучения кадров, соответствующей насущным потребностям. Следует отметить, что граница обучения кадров требует анализа стандартных подходов. Прежде всего, постоянный количественный рост и сфера нашей активности требует определения и уточнения благоприятных перспектив',
                'preview' => '/build/images/stocks/stock_03.jpg',
                'slug' => 'lada_granta_0_pervonachalnyj_vznos',
                'city_id' => 0,
            ],
            [
                'title' => 'Обмен на LADA Vesta выше рыночной цены',
                'text' => '<p>Не следует, однако, забывать, что начало повседневной работы по формированию позиции позволяет оценить значение благоприятных перспектив. Мы вынуждены отталкиваться от того, что понимание сути ресурсосберегающих технологий напрямую зависит от соответствующих условий активизации.</p>

<p>Реплицированные с зарубежных источников, современные исследования будут рассмотрены исключительно в разрезе маркетинговых и финансовых предпосылок! Предприниматели в сети интернет лишь добавляют фракционных разногласий и своевременно верифицированы. Учитывая ключевые сценарии поведения, сплочённость команды профессионалов представляет собой интересный эксперимент проверки позиций, занимаемых участниками в отношении поставленных задач. В рамках спецификации современных стандартов, представители современных социальных резервов функционально разнесены на независимые элементы.</p>

<p>Равным образом, повышение уровня гражданского сознания требует анализа форм воздействия. Сплочённость команды профессионалов требует от нас анализа экспериментов, поражающих по своей масштабности и грандиозности. Есть над чем задуматься: независимые государства, превозмогая сложившуюся непростую экономическую ситуацию, описаны максимально подробно. И нет сомнений, что ключевые особенности структуры проекта являются только методом политического участия и обнародованы. Лишь независимые государства призывают нас к новым свершениям, которые, в свою очередь, должны быть представлены в исключительно положительном свете.</p>',
                'text_short' => 'Не следует, однако, забывать, что начало повседневной работы по формированию позиции позволяет оценить значение благоприятных перспектив. Мы вынуждены отталкиваться от того, что понимание сути ресурсосберегающих технологий напрямую зависит от соответствующих условий активизации.',
                'preview' => '/build/images/stocks/stock_04.jpg',
                'slug' => 'obmen_na_lada_vesta_vyshe_rynochnoj_ceny',
                'city_id' => 0,
            ],
        ];

        DB::table('stocks')->insert($stocks);
    }
}
