<template>
    <section class="block block_1">
        <div class="block-text">
            <h2 v-html="models[number].title"></h2>
            <p>{{ models[number].text }}</p>
        </div>
        <div class="block-img">
            <img :src="'./img/blocks/block_01.png'" alt="">
        </div>
    </section>
</template>

<script>
    export default {
        name: 'App',
        props : ['number'],
        data: function () {
            return {
                models: [
                    {
                        title: '<span class="c_orange">Сочетая</span> самое лучшее',
                        text: 'Компактный внешне и удивительно просторный внутри. Быстрый, но экономичный. Способный одинаково успешно ездить в любых погодных условиях и в городе, и на трассе, и по проселку. Красивый, комфортный, недорогой. Казалось бы, автомобиль не может сочетать в себе так много плюсов, но LADA Granta — это под силу.',
                        url: './img/blocks/block_01.png'
                    },
                    {
                        title: '<span class="c_orange">Второй</span> the best',
                        text: 'Сомнение рефлектирует естественный закон исключённого третьего.. Интеллект естественно понимает под собой интеллигибельный закон внешнего мира, открывая новые горизонты. Гедонизм осмысляет дедуктивный метод. Аксиома силлогизма, по определению, представляет собой неоднозначный предмет деятельности. Надстройка нет',
                        url: './img/blocks/block_02.png'
                    },
                    {
                        title: '<span class="c_orange">Третий</span> наш текст',
                        text: 'Смысл жизни, следовательно, творит данный закон внешнего мира. Надстройка нетривиальна. Дедуктивный метод решительно представляет собой бабувизм. Сомнение рефлектирует естественный закон исключённого третьего.. Созерцание непредсказуемо. Импликация, следовательно, контролирует бабувизм, открывая новые горизонты.',
                        url: './img/blocks/block_02.png'
                    },
                    {
                        title: '<span class="c_orange">Четвертый</span> тест текста',
                        text: 'Структурализм абстрактен. Надстройка нетривиальна. Созерцание непредсказуемо. Отсюда естественно следует, что автоматизация дискредитирует предмет деятельности. Наряду с этим ощущение мира решительно контролирует непредвиденный гравитационный парадокс. Отсюда естественно следует, что автоматизация дискредитирует',
                        url: './img/blocks/block_02.png'
                    },
                    {
                        title: '<span class="c_orange">Пятый</span> важный контент',
                        text: 'Дедуктивный метод решительно представляет собой бабувизм. Гедонизм осмысляет дедуктивный метод. Созерцание непредсказуемо. Наряду с этим ощущение мира решительно контролирует непредвиденный гравитационный парадокс. Дискретность амбивалентно транспонирует гравитационный парадокс. ',
                        url: './img/blocks/block_02.png'
                    },
                    {
                        title: '<span class="c_orange">Шетой</span> лучший',
                        text: 'Компактный внешне и удивительно просторный внутри. Быстрый, но экономичный. Способный одинаково успешно ездить в любых погодных условиях и в городе, и на трассе, и по проселку. Красивый, комфортный, недорогой. Казалось бы, автомобиль не может сочетать в себе так много плюсов, но LADA Granta — это под силу.',
                        url: './img/blocks/block_02.png'
                    }
                ]
            }
        }
    };
</script>

<style lang="scss">
    @import "./resources/sass/info.scss";
</style>
